taurus_test/simulations/sample.yaml
settings:
  default-executor: gatling
  artifacts-dir: ../result/%Y-%m-%d_%H-%M-%S.%f

execution:
  - concurrency: 20
    ramp-up: 2m
    hold-for: 1m
    scenario: test

scenarios:
  test:
    requests:
      - label: user-create
        url: http://mock-server:8081/api/users
        method: POST
        headers:
          Content-Type: application/json
        body:
          name: 1
      - label: user-get
        url: http://mock-server:8081/api/users
        method: GET
        headers:
          Content-Type: application/json
        body:
          name: 1